nxp-mcuxpresso/mcux-sdk/devices/MKE04Z1284/MKE04Z1284.h
/*! @name MOD - RTC Modulo Register */
/*! @{ */
#define RTC_MOD_MOD_MASK                         (0xFFFFU)
#define RTC_MOD_MOD_SHIFT                        (0U)
#define RTC_MOD_MOD(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_MOD_MOD_SHIFT)) & RTC_MOD_MOD_MASK)
/*! @} */

/*! @name CNT - RTC Counter Register */
/*! @{ */
#define RTC_CNT_CNT_MASK                         (0xFFFFU)
#define RTC_CNT_CNT_SHIFT                        (0U)
#define RTC_CNT_CNT(x)                           (((uint32_t)(((uint32_t)(x)) << RTC_CNT_CNT_SHIFT)) & RTC_CNT_CNT_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group RTC_Register_Masks */


/* RTC - Peripheral instance base addresses */
/** Peripheral RTC base address */
#define RTC_BASE                                 (0x4003D000u)
/** Peripheral RTC base pointer */
#define RTC                                      ((RTC_Type *)RTC_BASE)
/** Array initializer of RTC peripheral base addresses */
#define RTC_BASE_ADDRS                           { RTC_BASE }
/** Array initializer of RTC peripheral base pointers */
#define RTC_BASE_PTRS                            { RTC }
/** Interrupt vectors for the RTC peripheral type */
#define RTC_IRQS                                 { RTC_IRQn }

/*!
 * @}
 */ /* end of group RTC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SIM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIM_Peripheral_Access_Layer SIM Peripheral Access Layer
 * @{
 */

/** SIM - Register Layout Typedef */
typedef struct {
  __I  uint32_t SRSID;                             /**< System Reset Status and ID Register, offset: 0x0 */
  __IO uint32_t SOPT0;                             /**< System Options Register 0, offset: 0x4 */
  __IO uint32_t SOPT1;                             /**< System Options Register, offset: 0x8 */
  __IO uint32_t PINSEL0;                           /**< Pin Selection Register 0, offset: 0xC */
  __IO uint32_t PINSEL1;                           /**< Pin Selection Register 1, offset: 0x10 */
  __IO uint32_t SCGC;                              /**< System Clock Gating Control Register, offset: 0x14 */
  __I  uint32_t UUIDL;                             /**< Universally Unique Identifier Low Register, offset: 0x18 */
  __I  uint32_t UUIDML;                            /**< Universally Unique Identifier Middle Low Register, offset: 0x1C */
  __I  uint32_t UUIDMH;                            /**< Universally Unique Identifier Middle High Register, offset: 0x20 */
  __IO uint32_t CLKDIV;                            /**< Clock Divider Register, offset: 0x24 */
} SIM_Type;

/* ----------------------------------------------------------------------------
   -- SIM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIM_Register_Masks SIM Register Masks
 * @{
 */

/*! @name SRSID - System Reset Status and ID Register */
/*! @{ */
#define SIM_SRSID_LVD_MASK                       (0x2U)
#define SIM_SRSID_LVD_SHIFT                      (1U)
/*! LVD - Low Voltage Detect
 *  0b0..Reset is not caused by LVD trip or POR.
 *  0b1..Reset is caused by LVD trip or POR.
 */
#define SIM_SRSID_LVD(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SRSID_LVD_SHIFT)) & SIM_SRSID_LVD_MASK)
#define SIM_SRSID_LOC_MASK                       (0x4U)
#define SIM_SRSID_LOC_SHIFT                      (2U)
/*! LOC - Internal Clock Source Module Reset
 *  0b0..Reset is not caused by the ICS module.
 *  0b1..Reset is caused by the ICS module.
 */
#define SIM_SRSID_LOC(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SRSID_LOC_SHIFT)) & SIM_SRSID_LOC_MASK)
#define SIM_SRSID_WDOG_MASK                      (0x20U)
#define SIM_SRSID_WDOG_SHIFT                     (5U)
/*! WDOG - Watchdog (WDOG)
 *  0b0..Reset is not caused by WDOG timeout.
 *  0b1..Reset is caused by WDOG timeout.
 */
#define SIM_SRSID_WDOG(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SRSID_WDOG_SHIFT)) & SIM_SRSID_WDOG_MASK)
#define SIM_SRSID_PIN_MASK                       (0x40U)
#define SIM_SRSID_PIN_SHIFT                      (6U)
/*! PIN - External Reset Pin
 *  0b0..Reset is not caused by external reset pin.
 *  0b1..Reset came from external reset pin.
 */
#define SIM_SRSID_PIN(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SRSID_PIN_SHIFT)) & SIM_SRSID_PIN_MASK)
#define SIM_SRSID_POR_MASK                       (0x80U)
#define SIM_SRSID_POR_SHIFT                      (7U)
/*! POR - Power-On Reset
 *  0b0..Reset not caused by POR.
 *  0b1..POR caused reset.
 */
#define SIM_SRSID_POR(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SRSID_POR_SHIFT)) & SIM_SRSID_POR_MASK)
#define SIM_SRSID_LOCKUP_MASK                    (0x200U)
#define SIM_SRSID_LOCKUP_SHIFT                   (9U)
/*! LOCKUP - Core Lockup
 *  0b0..Reset is not caused by core LOCKUP event.
 *  0b1..Reset is caused by core LOCKUP event.
 */
#define SIM_SRSID_LOCKUP(x)                      (((uint32_t)(((uint32_t)(x)) << SIM_SRSID_LOCKUP_SHIFT)) & SIM_SRSID_LOCKUP_MASK)
#define SIM_SRSID_SW_MASK                        (0x400U)
#define SIM_SRSID_SW_SHIFT                       (10U)
/*! SW - Software
 *  0b0..Reset is not caused by software setting of SYSRESETREQ bit.
 *  0b1..Reset caused by software setting of SYSRESETREQ bit
 */
#define SIM_SRSID_SW(x)                          (((uint32_t)(((uint32_t)(x)) << SIM_SRSID_SW_SHIFT)) & SIM_SRSID_SW_MASK)
#define SIM_SRSID_MDMAP_MASK                     (0x800U)
#define SIM_SRSID_MDMAP_SHIFT                    (11U)
/*! MDMAP - MDM-AP System Reset Request
 *  0b0..Reset is not caused by host debugger system setting of the System Reset Request bit.
 *  0b1..Reset is caused by host debugger system setting of the System Reset Request bit.
 */
#define SIM_SRSID_MDMAP(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SRSID_MDMAP_SHIFT)) & SIM_SRSID_MDMAP_MASK)
#define SIM_SRSID_SACKERR_MASK                   (0x2000U)
#define SIM_SRSID_SACKERR_SHIFT                  (13U)
/*! SACKERR - Stop Mode Acknowledge Error Reset
 *  0b0..Reset is not caused by peripheral failure to acknowledge attempt to enter Stop mode.
 *  0b1..Reset is caused by peripheral failure to acknowledge attempt to enter Stop mode.
 */
#define SIM_SRSID_SACKERR(x)                     (((uint32_t)(((uint32_t)(x)) << SIM_SRSID_SACKERR_SHIFT)) & SIM_SRSID_SACKERR_MASK)
#define SIM_SRSID_PINID_MASK                     (0xF0000U)
#define SIM_SRSID_PINID_SHIFT                    (16U)
/*! PINID - Device Pin ID
 *  0b0000..8-pin
 *  0b0001..16-pin
 *  0b0010..20-pin
 *  0b0011..24-pin
 *  0b0100..32-pin
 *  0b0101..44-pin
 *  0b0110..48-pin
 *  0b0111..64-pin
 *  0b1000..80-pin
 *  0b1010..100-pin
 */
#define SIM_SRSID_PINID(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SRSID_PINID_SHIFT)) & SIM_SRSID_PINID_MASK)
#define SIM_SRSID_RevID_MASK                     (0xF00000U)
#define SIM_SRSID_RevID_SHIFT                    (20U)
#define SIM_SRSID_RevID(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SRSID_RevID_SHIFT)) & SIM_SRSID_RevID_MASK)
#define SIM_SRSID_SUBFAMID_MASK                  (0xF000000U)
#define SIM_SRSID_SUBFAMID_SHIFT                 (24U)
/*! SUBFAMID - Kinetis sub-family ID
 *  0b0100..KEx4 sub-family
 *  0b0110..KEx6 sub-family
 */
#define SIM_SRSID_SUBFAMID(x)                    (((uint32_t)(((uint32_t)(x)) << SIM_SRSID_SUBFAMID_SHIFT)) & SIM_SRSID_SUBFAMID_MASK)
#define SIM_SRSID_FAMID_MASK                     (0xF0000000U)
#define SIM_SRSID_FAMID_SHIFT                    (28U)
/*! FAMID - Kinetis family ID
 *  0b0000..KE0x family.
 */
#define SIM_SRSID_FAMID(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SRSID_FAMID_SHIFT)) & SIM_SRSID_FAMID_MASK)
/*! @} */

/*! @name SOPT0 - System Options Register 0 */
/*! @{ */
#define SIM_SOPT0_NMIE_MASK                      (0x2U)
#define SIM_SOPT0_NMIE_SHIFT                     (1U)
/*! NMIE - NMI Pin Enable
 *  0b0..PTB4/KBI0_P12/FTM2_CH4/SPI0_MISO/ACMP1_IN2/NMI pin functions as PTB4, KBI0_P12, FTM2_CH4, SPI0_MISO or ACMP1_IN2.
 *  0b1..PTB4/KBI0_P12/FTM2_CH4/SPI0_MISO/ACMP1_IN2/NMI pin functions as NMI.
 */
#define SIM_SOPT0_NMIE(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_NMIE_SHIFT)) & SIM_SOPT0_NMIE_MASK)
#define SIM_SOPT0_RSTPE_MASK                     (0x4U)
#define SIM_SOPT0_RSTPE_SHIFT                    (2U)
/*! RSTPE - RESET Pin Enable
 *  0b0..PTA5/KBI0_P5/IRQ/TCLK0/RESET pin functions as PTA5/KBI0_P5/IRQ/TCLK0.
 *  0b1..PTA5/KBI0_P5/IRQ/TCLK0/RESET pin functions as RESET.
 */
#define SIM_SOPT0_RSTPE(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_RSTPE_SHIFT)) & SIM_SOPT0_RSTPE_MASK)
#define SIM_SOPT0_SWDE_MASK                      (0x8U)
#define SIM_SOPT0_SWDE_SHIFT                     (3U)
/*! SWDE - Single Wire Debug Port Pin Enable
 *  0b0..PTA4/KBI0_P4/ACMP0_OUT/SWD_DIO as PTA4 or ACMP0_OUT function, PTC4/KBI0_P20/RTC_CLKOUT/FTM1_CH0/ACMP0_IN2/SWD_CLK as PTC4, KBI0_P20, RTC_CLKOUT, FTM1_CH0, OR ACMP0_IN2 function.
 *  0b1..PTA4/KBI0_P4/ACMP0_OUT/SWD_DIO as SWD_DIO function, PTC4/KBI0_P20/RTC_CLKOUT/FTM1_CH0/ACMP0_IN2/SWD_CLK as SWD_CLK function.
 */
#define SIM_SOPT0_SWDE(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_SWDE_SHIFT)) & SIM_SOPT0_SWDE_MASK)
#define SIM_SOPT0_ACTRG_MASK                     (0x20U)
#define SIM_SOPT0_ACTRG_SHIFT                    (5U)
/*! ACTRG - ACMP Trigger FTM2 selection
 *  0b0..ACMP0 out
 *  0b1..ACMP1 out
 */
#define SIM_SOPT0_ACTRG(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_ACTRG_SHIFT)) & SIM_SOPT0_ACTRG_MASK)
#define SIM_SOPT0_RXDFE_MASK                     (0x300U)
#define SIM_SOPT0_RXDFE_SHIFT                    (8U)
/*! RXDFE - UART0 RxD Filter Select
 *  0b00..RXD0 input signal is connected to UART0 module directly.
 *  0b01..RXD0 input signal is filtered by ACMP0, then injected to UART0.
 *  0b10..RXD0 input signal is filtered by ACMP1, then injected to UART0.
 *  0b11..Reserved.
 */
#define SIM_SOPT0_RXDFE(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_RXDFE_SHIFT)) & SIM_SOPT0_RXDFE_MASK)
#define SIM_SOPT0_RTCC_MASK                      (0x400U)
#define SIM_SOPT0_RTCC_SHIFT                     (10U)
/*! RTCC - Real-Time Counter Capture
 *  0b0..RTC overflow is not connected to FTM1 input channel 1.
 *  0b1..RTC overflow is connected to FTM1 input channel 1.
 */
#define SIM_SOPT0_RTCC(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_RTCC_SHIFT)) & SIM_SOPT0_RTCC_MASK)
#define SIM_SOPT0_ACIC_MASK                      (0x800U)
#define SIM_SOPT0_ACIC_SHIFT                     (11U)
/*! ACIC - Analog Comparator to Input Capture Enable
 *  0b0..ACMP0 output is not connected to FTM1 input channel 0.
 *  0b1..ACMP0 output is connected to FTM1 input channel 0.
 */
#define SIM_SOPT0_ACIC(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_ACIC_SHIFT)) & SIM_SOPT0_ACIC_MASK)
#define SIM_SOPT0_RXDCE_MASK                     (0x1000U)
#define SIM_SOPT0_RXDCE_SHIFT                    (12U)
/*! RXDCE - UART0_RX Capture Select
 *  0b0..UART0_RX input signal is connected to the UART0 module only.
 *  0b1..UART0_RX input signal is connected to the UART0 module and FTM0 channel 1.
 */
#define SIM_SOPT0_RXDCE(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_RXDCE_SHIFT)) & SIM_SOPT0_RXDCE_MASK)
#define SIM_SOPT0_FTMSYNC_MASK                   (0x4000U)
#define SIM_SOPT0_FTMSYNC_SHIFT                  (14U)
/*! FTMSYNC - FTM2 Synchronization Select
 *  0b0..No synchronization triggered.
 *  0b1..Generates a PWM synchronization trigger to the FTM2 modules.
 */
#define SIM_SOPT0_FTMSYNC(x)                     (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_FTMSYNC_SHIFT)) & SIM_SOPT0_FTMSYNC_MASK)
#define SIM_SOPT0_TXDME_MASK                     (0x8000U)
#define SIM_SOPT0_TXDME_SHIFT                    (15U)
/*! TXDME - UART0_TX Modulation Select
 *  0b0..UART0_TX output is connected to pinout directly.
 *  0b1..UART0_TX output is modulated by FTM0 channel 0 before mapped to pinout.
 */
#define SIM_SOPT0_TXDME(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_TXDME_SHIFT)) & SIM_SOPT0_TXDME_MASK)
#define SIM_SOPT0_BUSREF_MASK                    (0x70000U)
#define SIM_SOPT0_BUSREF_SHIFT                   (16U)
/*! BUSREF - BUS Clock Output select
 *  0b000..Bus
 *  0b001..Bus divided by 2
 *  0b010..Bus divided by 4
 *  0b011..Bus divided by 8
 *  0b100..Bus divided by 16
 *  0b101..Bus divided by 32
 *  0b110..Bus divided by 64
 *  0b111..Bus divided by 128
 */
#define SIM_SOPT0_BUSREF(x)                      (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_BUSREF_SHIFT)) & SIM_SOPT0_BUSREF_MASK)
#define SIM_SOPT0_CLKOE_MASK                     (0x80000U)
#define SIM_SOPT0_CLKOE_SHIFT                    (19U)
/*! CLKOE - Bus Clock Output Enable
 *  0b0..Bus clock output is disabled on PTH2.
 *  0b1..Bus clock output is enabled on PTH2.
 */
#define SIM_SOPT0_CLKOE(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_CLKOE_SHIFT)) & SIM_SOPT0_CLKOE_MASK)
#define SIM_SOPT0_ADHWT_MASK                     (0x700000U)
#define SIM_SOPT0_ADHWT_SHIFT                    (20U)
/*! ADHWT - ADC Hardware Trigger Source
 *  0b000..RTC overflow as the ADC hardware trigger
 *  0b001..FTM0 as the ADC hardware trigger
 *  0b010..FTM2 init trigger with 8-bit programmable counter delay
 *  0b011..FTM2 match trigger with 8-bit programmable counter delay
 *  0b100..PIT channel0 overflow as the ADC hardware trigger
 *  0b101..PIT channel1 overflow as the ADC hardware trigger
 *  0b110..ACMP0 out as the ADC hardware trigger.
 *  0b111..ACMP1 out as the ADC hardware trigger
 */
#define SIM_SOPT0_ADHWT(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_ADHWT_SHIFT)) & SIM_SOPT0_ADHWT_MASK)
#define SIM_SOPT0_DLYACT_MASK                    (0x800000U)
#define SIM_SOPT0_DLYACT_SHIFT                   (23U)
/*! DLYACT - FTM2 Trigger Delay Active
 *  0b0..The delay is inactive.
 *  0b1..The delay is active.
 */
#define SIM_SOPT0_DLYACT(x)                      (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_DLYACT_SHIFT)) & SIM_SOPT0_DLYACT_MASK)
#define SIM_SOPT0_DELAY_MASK                     (0xFF000000U)
#define SIM_SOPT0_DELAY_SHIFT                    (24U)
#define SIM_SOPT0_DELAY(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SOPT0_DELAY_SHIFT)) & SIM_SOPT0_DELAY_MASK)
/*! @} */

/*! @name SOPT1 - System Options Register */
/*! @{ */
#define SIM_SOPT1_I2C04WEN_MASK                  (0x1U)
#define SIM_SOPT1_I2C04WEN_SHIFT                 (0U)
/*! I2C04WEN - I2C0 4-Wire Interface Enable
 *  0b0..I2C0 4-wire interface configuration is disabled.
 *  0b1..I2C0 4-wire interface configuration is enabled.
 */
#define SIM_SOPT1_I2C04WEN(x)                    (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_I2C04WEN_SHIFT)) & SIM_SOPT1_I2C04WEN_MASK)
#define SIM_SOPT1_I2C0OINV_MASK                  (0x2U)
#define SIM_SOPT1_I2C0OINV_SHIFT                 (1U)
/*! I2C0OINV - I2C0 Output Invert
 *  0b0..Under I2C0 4-wire interface configuration, SDA_OUT and SCL_OUT are not inverted before output
 *  0b1..Under I2C0 4-wire interface configuration, SDA_OUT and SCL_OUT are inverted before output
 */
#define SIM_SOPT1_I2C0OINV(x)                    (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_I2C0OINV_SHIFT)) & SIM_SOPT1_I2C0OINV_MASK)
#define SIM_SOPT1_ACPWTS_MASK                    (0x8U)
#define SIM_SOPT1_ACPWTS_SHIFT                   (3U)
/*! ACPWTS - PWT ACMP_OUT select
 *  0b0..ACMP1_OUT is connectted to PWTIN2.
 *  0b1..ACMP0_OUT is connectted to PWTIN2.
 */
#define SIM_SOPT1_ACPWTS(x)                      (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_ACPWTS_SHIFT)) & SIM_SOPT1_ACPWTS_MASK)
#define SIM_SOPT1_UARTPWTS_MASK                  (0x30U)
#define SIM_SOPT1_UARTPWTS_SHIFT                 (4U)
/*! UARTPWTS - PWT UART RX select
 *  0b00..UART0 RX is connectted to PWTIN3.
 *  0b01..UART1 RX is connectted to PWTIN3.
 *  0b10..UART2 RX is connectted to PWTIN3.
 *  0b11..Reserved.
 */
#define SIM_SOPT1_UARTPWTS(x)                    (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_UARTPWTS_SHIFT)) & SIM_SOPT1_UARTPWTS_MASK)
/*! @} */

/*! @name PINSEL0 - Pin Selection Register 0 */
/*! @{ */
#define SIM_PINSEL0_IRQPS_MASK                   (0x7U)
#define SIM_PINSEL0_IRQPS_SHIFT                  (0U)
/*! IRQPS - IRQ Port Pin Select
 *  0b000..IRQ is mapped on PTA5.
 *  0b001..IRQ is mapped on PTI0.
 *  0b010..IRQ is mapped on PTI1.
 *  0b011..IRQ is mapped on PTI2.
 *  0b100..IRQ is mapped on PTI3.
 *  0b101..IRQ is mapped on PTI4.
 *  0b110..IRQ is mapped on PTI5.
 *  0b111..IRQ is mapped on PTI6.
 */
#define SIM_PINSEL0_IRQPS(x)                     (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL0_IRQPS_SHIFT)) & SIM_PINSEL0_IRQPS_MASK)
#define SIM_PINSEL0_RTCPS_MASK                   (0x10U)
#define SIM_PINSEL0_RTCPS_SHIFT                  (4U)
/*! RTCPS - RTCO Pin Select
 *  0b0..RTCO is mapped on PTC4.
 *  0b1..RTCO is mapped on PTC5.
 */
#define SIM_PINSEL0_RTCPS(x)                     (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL0_RTCPS_SHIFT)) & SIM_PINSEL0_RTCPS_MASK)
#define SIM_PINSEL0_I2C0PS_MASK                  (0x20U)
#define SIM_PINSEL0_I2C0PS_SHIFT                 (5U)
/*! I2C0PS - I2C0 Port Pin Select
 *  0b0..I2C0_SCL and I2C0_SDA are mapped on PTA3 and PTA2, respectively.
 *  0b1..I2C0_SCL and I2C0_SDA are mapped on PTB7 and PTB6, respectively.
 */
#define SIM_PINSEL0_I2C0PS(x)                    (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL0_I2C0PS_SHIFT)) & SIM_PINSEL0_I2C0PS_MASK)
#define SIM_PINSEL0_SPI0PS_MASK                  (0x40U)
#define SIM_PINSEL0_SPI0PS_SHIFT                 (6U)
/*! SPI0PS - SPI0 Pin Select
 *  0b0..SPI0_SCK, SPI0_MOSI, SPI0_MISO, and SPI0_PCS are mapped on PTB2, PTB3, PTB4, and PTB5.
 *  0b1..SPI0_SCK, SPI0_MOSI, SPI0_MISO, and SPI0_PCS are mapped on PTE0, PTE1, PTE2, and PTE3.
 */
#define SIM_PINSEL0_SPI0PS(x)                    (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL0_SPI0PS_SHIFT)) & SIM_PINSEL0_SPI0PS_MASK)
#define SIM_PINSEL0_UART0PS_MASK                 (0x80U)
#define SIM_PINSEL0_UART0PS_SHIFT                (7U)
/*! UART0PS - UART0 Pin Select
 *  0b0..UART0_RX and UART0_TX are mapped on PTB0 and PTB1.
 *  0b1..UART0_RX and UART0_TX are mapped on PTA2 and PTA3.
 */
#define SIM_PINSEL0_UART0PS(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL0_UART0PS_SHIFT)) & SIM_PINSEL0_UART0PS_MASK)
#define SIM_PINSEL0_FTM0PS0_MASK                 (0x100U)
#define SIM_PINSEL0_FTM0PS0_SHIFT                (8U)
/*! FTM0PS0 - FTM0_CH0 Port Pin Select
 *  0b0..FTM0_CH0 channels are mapped on PTA0.
 *  0b1..FTM0_CH0 channels are mapped on PTB2.
 */
#define SIM_PINSEL0_FTM0PS0(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL0_FTM0PS0_SHIFT)) & SIM_PINSEL0_FTM0PS0_MASK)
#define SIM_PINSEL0_FTM0PS1_MASK                 (0x200U)
#define SIM_PINSEL0_FTM0PS1_SHIFT                (9U)
/*! FTM0PS1 - FTM0_CH1 Port Pin Select
 *  0b0..FTM0_CH1 channels are mapped on PTA1.
 *  0b1..FTM0_CH1 channels are mapped on PTB3.
 */
#define SIM_PINSEL0_FTM0PS1(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL0_FTM0PS1_SHIFT)) & SIM_PINSEL0_FTM0PS1_MASK)
#define SIM_PINSEL0_FTM1PS0_MASK                 (0x400U)
#define SIM_PINSEL0_FTM1PS0_SHIFT                (10U)
/*! FTM1PS0 - FTM1_CH0 Port Pin Select
 *  0b0..FTM1_CH0 channels are mapped on PTC4.
 *  0b1..FTM1_CH0 channels are mapped on PTH2.
 */
#define SIM_PINSEL0_FTM1PS0(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL0_FTM1PS0_SHIFT)) & SIM_PINSEL0_FTM1PS0_MASK)
#define SIM_PINSEL0_FTM1PS1_MASK                 (0x800U)
#define SIM_PINSEL0_FTM1PS1_SHIFT                (11U)
/*! FTM1PS1 - FTM1_CH1 Port Pin Select
 *  0b0..FTM1_CH1 channels are mapped on PTC5.
 *  0b1..FTM1_CH1 channels are mapped on PTE7.
 */
#define SIM_PINSEL0_FTM1PS1(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL0_FTM1PS1_SHIFT)) & SIM_PINSEL0_FTM1PS1_MASK)
#define SIM_PINSEL0_FTM0CLKPS_MASK               (0x3000000U)
#define SIM_PINSEL0_FTM0CLKPS_SHIFT              (24U)
/*! FTM0CLKPS - FTM0 TCLK Pin Select
 *  0b00..Selects TCLK0 for FTM0 module..
 *  0b01..Selects TCLK1 for FTM0 module.
 *  0b10..Selects TCLK2 for FTM0 module.
 *  0b11..Reserved.
 */
#define SIM_PINSEL0_FTM0CLKPS(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL0_FTM0CLKPS_SHIFT)) & SIM_PINSEL0_FTM0CLKPS_MASK)
#define SIM_PINSEL0_FTM1CLKPS_MASK               (0xC000000U)
#define SIM_PINSEL0_FTM1CLKPS_SHIFT              (26U)
/*! FTM1CLKPS - FTM1 TCLK Pin Select
 *  0b00..Selects TCLK0 for FTM1 module..
 *  0b01..Selects TCLK1 for FTM1 module.
 *  0b10..Selects TCLK2 for FTM1 module.
 *  0b11..Reserved.
 */
#define SIM_PINSEL0_FTM1CLKPS(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL0_FTM1CLKPS_SHIFT)) & SIM_PINSEL0_FTM1CLKPS_MASK)
#define SIM_PINSEL0_FTM2CLKPS_MASK               (0x30000000U)
#define SIM_PINSEL0_FTM2CLKPS_SHIFT              (28U)
/*! FTM2CLKPS - FTM2 TCLK Pin Select
 *  0b00..Selects TCLK0 for FTM2 module..
 *  0b01..Selects TCLK1 for FTM2 module.
 *  0b10..Selects TCLK2 for FTM2 module.
 *  0b11..Reserved.
 */
#define SIM_PINSEL0_FTM2CLKPS(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL0_FTM2CLKPS_SHIFT)) & SIM_PINSEL0_FTM2CLKPS_MASK)
#define SIM_PINSEL0_PWTCLKPS_MASK                (0xC0000000U)
#define SIM_PINSEL0_PWTCLKPS_SHIFT               (30U)
/*! PWTCLKPS - PWT TCLK Pin Select
 *  0b00..Selects TCLK0 for PWT module.
 *  0b01..Selects TCLK1 for PWT module.
 *  0b10..Selects TCLK2 for PWT module.
 *  0b11..Reserved.
 */
#define SIM_PINSEL0_PWTCLKPS(x)                  (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL0_PWTCLKPS_SHIFT)) & SIM_PINSEL0_PWTCLKPS_MASK)
/*! @} */

